:PROPERTIES:
:ID:       430E0509-84E4-4C32-A2B7-8EA0A4BB7200
:header-args: :results output
:END:
#+title: tesseract
* Installation

#+begin_src shell :session brew :async
  brew install tesseract
#+end_src

#+RESULTS:
#+begin_example
brew install tesseract
==> Auto-updating Homebrew...
Adjust how often this is run with `$HOMEBREW_AUTO_UPDATE_SECS` or disable with
`$HOMEBREW_NO_AUTO_UPDATE=1`. Hide these hints with `$HOMEBREW_NO_ENV_HINTS=1` (see `man brew`).
✔︎ JSON API packages.arm64_tahoe.jws.json
==> Auto-updated Homebrew!
Updated 2 taps (homebrew/core and homebrew/cask).
==> New Formulae
asccli: App Store Connect CLI to manage apps, versions, and screenshots
avisynthplus: Improved version of the AviSynth frameserver
bttf: CLI tool for datetime arithmetic, parsing, formatting and more
container-use: Dev envs for coding agents. Run multiple agents safely with your stack
eas-cli: Command-line tool for working with Expo Application Services
kdash: Simple and fast dashboard for Kubernetes
keyd: Key remapping daemon for Linux
libcext: C utility library for Common Pipeline Library (CPL)
md-tui: Markdown renderer in the terminal written in rust
merman-cli: Mermaid.js, but headless, in Rust
mimo-code: AI coding agent with cross-session memory
netwatch: Cross-platform realtime network diagnostics TUI
officecli: Read, edit, and automate Office documents (.docx, .xlsx, .pptx)
pdf.tocgen: CLI toolset to generate table of contents for PDF files automatically
pkgsite: Documentation server for Go packages
pup: CLI companion with 200+ commands across 33+ Datadog products
safestringlib: Safe string operations and memory routines
swgp-go: Simple WireGuard proxy with minimal overhead for WireGuard traffic
syswatch: Cross-platform system diagnostics TUI
vulcain: Fast and idiomatic client-driven REST APIs
zot: Lightweight coding agent harness written in Go
==> New Casks
flow5: Potential flow solver for preliminary aerodynamic and hydrofoil design
r-rig-app: R Installation Manager
shade: AI-powered media storage and asset management platform
terax: Terminal-first AI-native developer workspace

You have 22 outdated formulae and 1 outdated cask installed.
Warning: Skipping kde-mac/kde because it is not trusted. Run `brew trust kde-mac/kde` to trust it.
Warning: Skipping kde-mac/kde because it is not trusted. Run `brew trust kde-mac/kde` to trust it.

Warning: tesseract 5.5.2 is already installed and up-to-date.
To reinstall 5.5.2, run:
  brew reinstall tesseract
[?2004hecho 'ob_comint_async_shell_end_76393d17-f98f-4563-b9b3-f4b1c7169410'[?2004l
#+end_example

#+begin_src shell
  tesseract --version
#+end_src

#+RESULTS:
: tesseract 5.5.2
:  leptonica-1.87.0
:   libgif 5.2.2 : libjpeg 8d (libjpeg-turbo 3.1.3) : libpng 1.6.58 : libtiff 4.7.1 : zlib 1.2.12 : libwebp 1.6.0 : libopenjp2 2.5.4
:  Found NEON
:  Found libarchive 3.8.7 zlib/1.2.12 liblzma/5.8.3 bz2lib/1.0.8 liblz4/1.10.0 libzstd/1.5.7 expat/expat_2.7.3 CommonCrypto/system libb2/system
:  Found libcurl/8.7.1 SecureTransport (LibreSSL/3.3.6) zlib/1.2.12 nghttp2/1.68.0

* Help

#+begin_src shell
  tesseract --help
#+end_src

#+RESULTS:
#+begin_example
Usage:
  tesseract --help | --help-extra | --version
  tesseract --list-langs
  tesseract imagename outputbase [options...] [configfile...]

OCR options:
  -l LANG[+LANG]        Specify language(s) used for OCR.
NOTE: These options must occur before any configfile.

Single options:
  --help                Show this help message.
  --help-extra          Show extra help for advanced users.
  --version             Show version information.
  --list-langs          List available languages for tesseract engine.
#+end_example

#+begin_src shell
  tesseract --help-extra
#+end_src

#+RESULTS:
#+begin_example
Usage:
  tesseract --help | --help-extra | --help-psm | --help-oem | --version
  tesseract --list-langs [--tessdata-dir PATH]
  tesseract --print-fonts-table [options...] [configfile...]
  tesseract --print-parameters [options...] [configfile...]
  tesseract imagename|imagelist|stdin outputbase|stdout [options...] [configfile...]

OCR options:
  --tessdata-dir PATH   Specify the location of tessdata path.
  --user-words PATH     Specify the location of user words file.
  --user-patterns PATH  Specify the location of user patterns file.
  --dpi VALUE           Specify DPI for input image.
  --loglevel LEVEL      Specify logging level. LEVEL can be
                        ALL, TRACE, DEBUG, INFO, WARN, ERROR, FATAL or OFF.
  -l LANG[+LANG]        Specify language(s) used for OCR.
  -c VAR=VALUE          Set value for config variables.
                        Multiple -c arguments are allowed.
  --psm PSM|NUM         Specify page segmentation mode.
  --oem OEM|NUM         Specify OCR Engine mode.
NOTE: These options must occur before any configfile.

Page segmentation modes (PSM):
  0|osd_only                Orientation and script detection (OSD) only.
  1|auto_osd                Automatic page segmentation with OSD.
  2|auto_only               Automatic page segmentation, but no OSD, or OCR. (not implemented)
  3|auto                    Fully automatic page segmentation, but no OSD. (Default)
  4|single_column           Assume a single column of text of variable sizes.
  5|single_block_vert_text  Assume a single uniform block of vertically aligned text.
  6|single_block            Assume a single uniform block of text.
  7|single_line             Treat the image as a single text line.
  8|single_word             Treat the image as a single word.
  9|circle_word             Treat the image as a single word in a circle.
 10|single_char             Treat the image as a single character.
 11|sparse_text             Sparse text. Find as much text as possible in no particular order.
 12|sparse_text_osd         Sparse text with OSD.
 13|raw_line                Raw line. Treat the image as a single text line,
                            bypassing hacks that are Tesseract-specific.

OCR Engine modes (OEM):
  0|tesseract_only          Legacy engine only.
  1|lstm_only               Neural nets LSTM engine only.
  2|tesseract_lstm_combined Legacy + LSTM engines.
  3|default                 Default, based on what is available.

Single options:
  -h, --help            Show minimal help message.
  --help-extra          Show extra help for advanced users.
  --help-psm            Show page segmentation modes.
  --help-oem            Show OCR Engine modes.
  -v, --version         Show version information.
  --list-langs          List available languages for tesseract engine.
  --print-fonts-table   Print tesseract fonts table.
  --print-parameters    Print tesseract parameters.
#+end_example
